<div class="about">
  <h1>About</h1>
  <h2>概要</h2>
  <p>たこの餌やりやトイレ掃除等を管理するアプリです。</p>
  <h2>使い方</h2>
  <h3>ログイン</h3>
  <p>
    まずログインしてください。ログインしないとRecordsページにアクセスはできません。
    ユーザー登録はできないので管理者に問い合わせてください。
  </p>
  <h3>レコード管理</h3>
  <p>
    Recordsページでは、今までのお世話記録のレコードをリスト表示できます。
    表示する期間・タイプの選択が画面上部の設定で可能です。
    日付の上限と下限、タイプを設定して取得ボタンを押してください。
    タイプは---を選択すると全タイプのレコードを取得します。
  </p>
  <p>
    レコードを追加するときはタイプとコメントを入力して追加を押すだけです。
    タイプは必須、コメントは任意です。追加を押すとすぐにデータベースに追加されます。
  </p>
  <p>
    <s>ユーザーと時刻は自分で設定はできず、自動で反映されます。</s>
    時刻は任意の入力が可能になりました。 入力ボックスを開くと日付と時刻の指定を行うボックスが開きます。
    このボックスを開いたまま「追加」すると任意の時刻を反映したレコードを追加できます。 閉じて追加すると入力されていたとしても無視されます。
    入力を行うときは時の次に分をクリック・タップします（分を先に入力することができません）。 過去の時刻を入力した場合、追加した直後とリロード後でレコードの並び順がずれることがあります。
    ユーザーは依然自動でのみ反映されます。
  </p>
  <p>
    レコードについているxボタンは削除ボタンです。削除したレコードは復元できないので注意してください。
    また、自分が追加したレコードしか削除できません（他人のレコードのボタンは薄くなり押すことができません）。
  </p>
  <p>
    バージョン0.3から画像を添付できるようになりました。
    一枚のみレコードに画像をつけることができます。 画像が添付されたレコードは容易に判別できます。
    ボタンをタップすれば画像が表示され、表示中に画面をタップすれば格納されます。
    レコードを削除すると画像も削除され、復元できないので注意してください。
    画像のみを消去することはできません。
  </p>

  <h2>更新履歴</h2>
  <p>2021/11/03：開発開始。</p>
  <p>2021/11/09：初版v0.1.0公開。</p>
  <p>2022/02/20：任意時刻入力機能やコメントの折りたたみ機能を追加してv0.2.0を公開。</p>
  <p>2022/06/08：写真アップロード機能等を追加しv0.3.0を公開。</p>
  <p>2022/06/09：コードのリファクタリングと最適化を行ったv0.3.1を公開。</p>
  <p>2022/06/21：年表記を削除（v0.3.2）。</p>
  <p>2022/07/30：レコード検索機能を追加（v0.3.3）。</p>
  <p>2022/08/08：デザインを大幅に変更し、v0.4.0を公開。</p>
  <p>
    2023/01/18：UIを刷新。機能は変わっていないが、開発に用いたフレームワークも変更した（Vue.jsからSvelte）。シングルページアプリケーションではなくなり、CSSフレームワークの使用をやめた。（v0.7.0とする）
  </p>
  <p>2023/01/19：ファイルアップローダーの不具合を修正。（v0.7.1）</p>
  <p>2023/02/10：レコード個別のページを作成。少しパフォーマンスの改善（v0.7.5）。</p>
  <p>2023/02/11：他人の個別ページを見られない問題を修正（v0.7.6）。</p>
</div>

<style>
  .about {
    width: 80%;
    margin: auto;
  }
  h2 {
    border: 4px dotted #777;
    margin: 1rem 0;
  }
</style>
