<div class="about">
  <h1>About</h1>
  <h2>概要</h2>
  <p>たこの餌やりやトイレ掃除等を管理するアプリです。</p>
  <h2>使い方</h2>
  <h3>ログイン</h3>
  <p>
    まずログインしてください。ログインしないとRecordsページにアクセスはできません。
    ユーザー登録はできないので管理者に問い合わせてください。
  </p>
  <h3>レコード管理</h3>
  <p>
    Recordsページでは、今までのお世話記録のレコードをリスト表示できます。
    表示する期間・タイプの選択が画面上部の設定で可能です。
    日付の上限と下限、タイプを設定して取得ボタンを押してください。
    タイプは---を選択すると全タイプのレコードを取得します。
  </p>
  <p>
    レコードを追加するときはタイプとコメントを入力して追加を押すだけです。
    タイプは必須、コメントは任意です。追加を押すとすぐにデータベースに追加されます。
  </p>
  <p>
    <s>ユーザーと時刻は自分で設定はできず、自動で反映されます。</s>
    時刻は任意の入力が可能になりました。 入力ボックスを開くと日付と時刻の指定を行うボックスが開きます。
    このボックスを開いたまま「追加」すると任意の時刻を反映したレコードを追加できます。 閉じて追加すると入力されていたとしても無視されます。
    入力を行うときは時の次に分をクリック・タップします（分を先に入力することができません）。 過去の時刻を入力した場合、追加した直後とリロード後でレコードの並び順がずれることがあります。
    ユーザーは依然自動でのみ反映されます。
  </p>
  <p>
    レコードについているxボタンは削除ボタンです。削除したレコードは復元できないので注意してください。
    また、自分が追加したレコードしか削除できません（他人のレコードのボタンは薄くなり押すことができません）。
  </p>
  <p>
    バージョン0.3から画像を添付できるようになりました。
    一枚のみレコードに画像をつけることができます。 画像が添付されたレコードは容易に判別できます。
    ボタンをタップすれば画像が表示され、表示中に画面をタップすれば格納されます。
    レコードを削除すると画像も削除され、復元できないので注意してください。
    画像のみを消去することはできません。
  </p>
</div>

<style>
  .about {
    width: 80%;
    margin: auto;
  }
  h2 {
    border: 4px dotted #777;
  }
</style>
